NORMAL_SKILL = {
    '会计': 5,
    '动物驯养': 5,
    '人类学': 1,
    '估价': 5,
    '考古学': 1,
    '炮术': 1,
    '魅惑': 15,
    '攀爬': 20,
    '计算机': 5,
    '信用评级': 0,
    '克苏鲁神话': 0,
    '爆破': 1,
    '乔装': 5,
    '潜水': 1,
    '闪避': 'DEX一半的',
    '汽车驾驶': 20,
    '电气维修': 10,
    '电子学': 1,
    '话术': 5,
    '急救': 30,
    '历史': 5,
    '催眠': 1,
    '恐吓': 15,
    '跳跃': 20,
    '母语': 'EDU',
    '法律': 5,
    '图书馆': 20,
    '聆听': 20,
    '锁匠': 1,
    '机械维修': 10,
    '医学': 1,
    '博物学': 10,
    '领航': 10,
    '神秘学': 5,
    '操作重型机械': 1,
    '说服': 10,
    '精神分析': 1,
    '心理学': 10,
    '读唇': 1,
    '骑术': 5,
    '妙手': 10,
    '侦查': 25,
    '潜行': 20,
    '游泳': 20,
    '投掷': 20,
    '追踪': 10,
}

ART = {
    '艺术/手艺(表演)': 5,
    '艺术/手艺(理发)': 5,
    '艺术/手艺(书法)': 5,
    '艺术/手艺(木匠)': 5,
    '艺术/手艺(厨艺)': 5,
    '艺术/手艺(舞蹈)': 5,
    '艺术/手艺(美术)': 5,
    '艺术/手艺(伪造)': 5,
    '艺术/手艺(写作)': 5,
    '艺术/手艺(莫里斯舞蹈)': 5,
    '艺术/手艺(歌剧歌唱)': 5,
    '艺术/手艺(粉刷匠和油漆工)': 5,
    '艺术/手艺(摄影)': 5,
    '艺术/手艺(制陶)': 5,
    '艺术/手艺(雕塑)': 5,
    '艺术/手艺(吹真空管)': 5,
    '艺术/手艺(技术制图)': 5,
    '艺术/手艺(文学)': 5,
    '艺术/手艺(烹饪)': 5,
    '艺术/手艺(裁缝)': 5,
    '艺术/手艺(器乐)': 5,
    '艺术/手艺(耕作)': 5,
    '艺术/手艺(声乐)': 5,
    '艺术/手艺(木工)': 5,
    '艺术/手艺(焊接)': 5,
    '艺术/手艺(打字)': 5,
    '艺术/手艺(速记)': 5,
}

SCIENCE = {
    '科学(天文学)': 1,
    '科学(生物学)': 1,
    '科学(植物学)': 1,
    '科学(化学)': 1,
    '科学(密码学)': 1,
    '科学(工程学)': 1,
    '科学(司法学)': 1,
    '科学(地质学)': 1,
    '科学(数学)': 1,
    '科学(气象学)': 1,
    '科学(药学)': 1,
    '科学(物理学)': 1,
    '科学(动物学)': 1,
}

SURVIVE = {
    '生存(沙漠)': 10,
    '生存(极地)': 10,
    '生存(热带雨林)': 10,
    '生存(深海)': 10,
    '生存(荒岛)': 10,
    '生存(海上)': 10,
}

ACADEMIC = {
    '学术(外星人学问)': 1,
    '学术(UFO学问)': 1,
    '学术(阴谋论学问)': 1,
    '学术(吸血鬼学问)': 1,
    '学术(梦学问)': 1,
    '学术(社会主义学问)': 1,
}

DRIVE = {
    '驾驶(飞行器)': 1,
    '驾驶(船)': 1,
}

GRAPPLE = {
    '格斗(斧头)': 15,
    '格斗(斗殴)': 25,  # 空手格斗
    '格斗(电锯)': 10,
    '格斗(连枷)': 10,
    '格斗(绞索)': 15,
    '格斗(矛)': 20,
    '格斗(剑)': 20,
    '格斗(鞭子)': 5,
}

SHOT = {
    '射击(弓)': 15,
    '射击(手枪)': 20,
    '射击(重武器)': 10,
    '射击(火焰喷射器)': 10,
    '射击(机关枪)': 10,
    '射击(步枪/霰弹枪)': 25,
    '射击(冲锋枪)': 15,
}

LANGUAGE_CATEGORY = ['英语', '法语', '西班牙语', '俄语', '阿拉伯语', '汉语', '德语', '日语', '葡萄牙语', '印地语/乌尔都语', '拉丁文']

OTHER_LANGUAGE = {'外语({})'.format(l): 1 for l in LANGUAGE_CATEGORY}

DEFAULT_SKILL_RANK = dict(**NORMAL_SKILL, **ART, **SCIENCE, **SURVIVE, **DRIVE, **GRAPPLE, **SHOT, **OTHER_LANGUAGE,
                          **ACADEMIC)

if __name__ == '__main__':
    import json

    wocao = """\
skill_social={'话术': true, '魅惑': true, '说服': true, '恐吓': true}
skill_art={"艺术/手艺(表演)": true, "艺术/手艺(理发)": true, "艺术/手艺(书法)": true, "艺术/手艺(木匠)": true, "艺术/手艺(厨艺)": true, "艺术/手艺(舞蹈)": true, "艺术/手艺(美术)": true, "艺术/手艺(伪造)": true, "艺术/手艺(写作)": true, "艺术/手艺(莫里斯舞蹈)": true, "艺术/手艺(歌剧歌唱)": true, "艺术/手艺(粉刷匠和油漆工)": true, "艺术/手艺(摄影)": true, "艺术/手艺(制陶)": true, "艺术/手艺(雕塑)": true, "艺术/手艺(吹真空管)": true, "艺术/手艺(技术制图)": true, "艺术/手艺(文学)": true, "艺术/手艺(烹饪)": true, "艺术/手艺(裁缝)": true, "艺术/手艺(器乐)": true, "艺术/手艺(耕作)": true, "艺术/手艺(声乐)": true, "艺术/手艺(木工)": true, "艺术/手艺(焊接)": true, "艺术/手艺(打字)": true, "艺术/手艺(速记)": true}
skill_science={"科学(天文学)": true, "科学(生物学)": true, "科学(植物学)": true, "科学(化学)": true, "科学(密码学)": true, "科学(工程学)": true, "科学(司法学)": true, "科学(地质学)": true, "科学(数学)": true, "科学(气象学)": true, "科学(药学)": true, "科学(物理学)": true, "科学(动物学)": true}
skill_survive ={"生存(沙漠)": true, "生存(极地)": true, "生存(热带雨林)": true, "生存(深海)": true, "生存(荒岛)": true, "生存(海上)": true}
skill_academic={"学术(外星人学问)": true, "学术(UFO学问)": true, "学术(阴谋论学问)": true, "学术(吸血鬼学问)": true, "学术(梦学问)": true, "学术(社会主义学问)": true}
skill_drive={"驾驶(飞行器)": true, "驾驶(船)": true}
skill_fight={"格斗(斧头)": true, "格斗(斗殴)": true, "格斗(电锯)": true, "格斗(连枷)": true, "格斗(绞索)": true, "格斗(矛)": true, "格斗(剑)": true, "格斗(鞭子)": true}
skill_shot={"射击(弓)": true, "射击(手枪)": true, "射击(重武器)": true, "射击(火焰喷射器)": true, "射击(机关枪)": true, "射击(步枪/霰弹枪)": true, "射击(冲锋枪)": true}
skill_other_language={"外语(英语)": true, "外语(法语)": true, "外语(西班牙语)": true, "外语(俄语)": true, "外语(阿拉伯语)": true, "外语(汉语)": true, "外语(德语)": true, "外语(日语)": true, "外语(葡萄牙语)": true, "外语(印地语/乌尔都语)": true, "外语(拉丁文)": true}
"""
# with open('../../normal_skill.json', 'r', encoding='utf-8') as rf:
#     jj = json.load(rf)
#     for j in jj:
#         print(
#             "'{}': {},".format(j.get('技能'), j.get('初始值') if not j.get('初始值').startswith('0') else j.get('初始值')[1:]))
# jj = json.dumps({k: True for k, v in SCIENCE.items()}, ensure_ascii=False)
# print(jj)

    for w in wocao.split('\n'):
        j = json.loads(w)
        print(j)

# i = j = 0
# for k, v in NORMAL_SKILL.items():
#     print('{}-0'.format(i), k, v)
#     i += 1
#
# for item in [ART, SCIENCE, SURVIVE, ACADEMIC, DRIVE, GRAPPLE, SHOT, OTHER_LANGUAGE]:
#     j = 0
#     for k, v in item.items():
#         print('{}-{}'.format(i, j), k, v)
#         j += 1
#
#     i += 1
