"""
人物的db设置
属性可以一一对应
习得技能
默认技能

策略：运行时实例化，在内存读写，每隔一段时间写入db

建表
pk | 玩家 | 剧本号 | 头像 | 姓名 | 年龄 | 性别 | 属性 | HP | MP | SAN | LUCK | 习得技能 | 背景
{"name":"露露","sex":"女","property":{"str":85,"con":60,"siz":50,"dex":55,"app":90,"pow":50,"int":45,"edu":88,"luck":70},"age":22,"job":"艺人","credit":35,"skill":{"乔装":45,"魅惑":80,"话术":45,"聆听":37,"心理学":55,"精神分析":75,"图书馆":20,"艺术/手艺(声乐)":45,"说服":35,"侦查":45,"潜行":35,"艺术/手艺(歌剧歌唱)":35},"person_label":["迷人的","长头发","苗条的"],"person_multi_property":["人类无需上帝。(例如坚定的无神论者，人文主义者，世俗主义者)","兄弟。(例如妹妹，半血亲妹妹，无血缘妹妹)","同甘共苦。(例如，你们共同经历过困难时期，你们携手成长，共同度过战争)","联系你思想/信念的场所。(例如，小教堂，麦加，巨石阵)","宠物。(例如狗，猫，乌龟)","异性缘好/万人迷。(例如，长袖善舞，甜言蜜语，电眼乱放)"]}
"""